app/controllers/api/channels_controller.rb

  def index
    @channels = Channel.all
---
SELECT "channels".* FROM "channels"

  def set_channel
    @channel = Channel.find_by(name: params[:name])
---
SELECT  "channels".* FROM "channels" WHERE "channels"."name" = $1 LIMIT $2  [["name", "general"], ["LIMIT", 1]]